--幸运飞艇 下注区域
g_caipiaoDefine.lhcpourtype ={}
g_caipiaoDefine.lhc_game_type = 6002
g_caipiaoDefine.lhc_gamekey = 2
g_caipiaoDefine.lhc_test_times = 60*5 - 5

g_caipiaoDefine.lhc_open_later_times = 5*60 --开奖时间延迟的时间(s) 5分钟后开奖
g_caipiaoDefine.lhc_open_earlier_times = 60*60 --开奖时间 的提前时间(s) 一个小时

g_caipiaoDefine.lhc_check_unsettle_times  = 10


g_caipiaoDefine.lhcpourtype =
{
    --------------------------------------------------------------
    -----------------------------特码-----------------------------
    --------------------------------------------------------------
    --特码
    [1001] = { title = "特码", name = "1"      , rate = 4650 },
    [1002] = { title = "特码", name = "2"      , rate = 4650},
    [1003] = { title = "特码", name = "3"      , rate = 4650},
    [1004] = { title = "特码", name = "4"      , rate = 4650},
    [1005] = { title = "特码", name = "5"      , rate = 4650 },
    [1006] = { title = "特码", name = "6"      , rate = 4650 },
    [1007] = { title = "特码", name = "7"      , rate = 4650 },
    [1008] = { title = "特码", name = "8"      , rate = 4650 },
    [1009] = { title = "特码", name = "9"      , rate = 4650 },
    [1010] = { title = "特码", name = "10"     , rate = 4650 },
    [1011] = { title = "特码", name = "11"     , rate = 4650 },
    [1012] = { title = "特码", name = "12"     , rate = 4650 },
    [1013] = { title = "特码", name = "13"     , rate = 4650 },
    [1014] = { title = "特码", name = "14"     , rate = 4650 },
    [1015] = { title = "特码", name = "15"     , rate = 4650 },
    [1016] = { title = "特码", name = "16"     , rate = 4650 },
    [1017] = { title = "特码", name = "17"     , rate = 4650 },
    [1018] = { title = "特码", name = "18"     , rate = 4650 },
    [1019] = { title = "特码", name = "19"     , rate = 4650 },
    [1020] = { title = "特码", name = "20"     , rate = 4650 },
    [1021] = { title = "特码", name = "21"     , rate = 4650 },
    [1022] = { title = "特码", name = "22"     , rate = 4650 },
    [1023] = { title = "特码", name = "23"     , rate = 4650 },
    [1024] = { title = "特码", name = "24"     , rate = 4650 },
    [1025] = { title = "特码", name = "25"     , rate = 4650 },
    [1026] = { title = "特码", name = "26"     , rate = 4650 },
    [1027] = { title = "特码", name = "27"     , rate = 4650 },
    [1028] = { title = "特码", name = "28"     , rate = 4650 },
    [1029] = { title = "特码", name = "29"     , rate = 4650 },
    [1030] = { title = "特码", name = "30"     , rate = 4650 },
    [1031] = { title = "特码", name = "31"     , rate = 4650 },
    [1032] = { title = "特码", name = "32"     , rate = 4650 },
    [1033] = { title = "特码", name = "33"     , rate = 4650 },
    [1034] = { title = "特码", name = "34"     , rate = 4650 },
    [1035] = { title = "特码", name = "35"     , rate = 4650 },
    [1036] = { title = "特码", name = "36"     , rate = 4650 },
    [1037] = { title = "特码", name = "37"     , rate = 4650 },
    [1038] = { title = "特码", name = "38"     , rate = 4650 },
    [1039] = { title = "特码", name = "39"     , rate = 4650 },
    [1040] = { title = "特码", name = "40"     , rate = 4650 },
    [1041] = { title = "特码", name = "41"     , rate = 4650 },
    [1042] = { title = "特码", name = "42"     , rate = 4650 },
    [1043] = { title = "特码", name = "43"     , rate = 4650 },
    [1044] = { title = "特码", name = "44"     , rate = 4650 },
    [1045] = { title = "特码", name = "45"     , rate = 4650 },
    [1046] = { title = "特码", name = "46"     , rate = 4650 },
    [1047] = { title = "特码", name = "47"     , rate = 4650 },
    [1048] = { title = "特码", name = "48"     , rate = 4650 },
    [1049] = { title = "特码", name = "49"     , rate = 4650 },

    --两面
    --------------------------------------------------------------
    -----------------------------总和---------------------------
    --------------------------------------------------------------
    --总和
    [2001] = { title = "两面" ,   name = "总和大"  , rate = 195 },
    [2002] = { title = "两面" ,   name = "总和小"  , rate = 195 },
    [2003] = { title = "两面" ,   name = "总和单"  , rate = 195 },
    [2004] = { title = "两面" ,   name = "总和双"  , rate = 195 },
    [2005] = { title = "两面" ,   name = "特大"    , rate = 195 },
    [2006] = { title = "两面" ,   name = "特小"    , rate = 195 },
    [2007] = { title = "两面" ,   name = "特单"    , rate = 195 },
    [2008] = { title = "两面" ,   name = "特双"    , rate = 195 },
    [2009] = { title = "两面" ,   name = "特合大"  , rate = 195 },
    [2010] = { title = "两面" ,   name = "特合小"  , rate = 195 },
    [2011] = { title = "两面" ,   name = "特合单"  , rate = 195 },
    [2012] = { title = "两面" ,   name = "特合双"  , rate = 195 },

    --------------------------------------------------------------
    ----------------------------色波----------------------------
    --------------------------------------------------------------
    --色波
    [3001] = { title = "色波" , name = "红波"  , rate = 250 },
    [3002] = { title = "色波" , name = "蓝波"  , rate = 250 },
    [3003] = { title = "色波" , name = "绿波"  , rate = 250 },

    --------------------------------------------------------------
    ----------------------------特肖----------------------------
    --------------------------------------------------------------
    --特肖
    [4001] = { title = "特肖" ,   name = "鼠"  , rate = 1050 },
    [4002] = { title = "特肖" ,   name = "牛"  , rate = 1050 },
    [4003] = { title = "特肖" ,   name = "虎"  , rate = 1050 },
    [4004] = { title = "特肖" ,   name = "兔"  , rate = 1050 },
    [4005] = { title = "特肖" ,   name = "龙"  , rate = 1050 },
    [4006] = { title = "特肖" ,   name = "蛇"  , rate = 1050 },
    [4007] = { title = "特肖" ,   name = "马"  , rate = 1050 },
    [4008] = { title = "特肖" ,   name = "羊"  , rate = 1050 },
    [4009] = { title = "特肖" ,   name = "猴"  , rate = 1050 },
    [4010] = { title = "特肖" ,   name = "鸡"  , rate = 1050 },
    [4011] = { title = "特肖" ,   name = "狗"  , rate = 1050 },
    [4012] = { title = "特肖" ,   name = "猪"  , rate = 850 },
}